Процедура ПростыеЧисла() Экспорт

	ДанныеПотока = Новый Структура("Статус,Начало,Конец,Результат,Длительность,Ожидание");
	ДанныеПотока.Статус = "Пустой";
	ДанныеПотока.Начало = 0;
	ДанныеПотока.Конец = 0;
	ДанныеПотока.Результат = Неопределено;
    ДанныеПотока.Длительность = 0;
	ДанныеПотока.Ожидание = 0;

	Мьютекс = РегистрыСведений.Мьютекс.ПолучитьЭкземпляр(0);
		
	Пока Истина Цикл
		
		// отдаем результат (если есть) и забираем новую порцию:
		Мьютекс.ОбработатьДанныеЭксклюзивно("ОтдатьЗабратьПорцию", ДанныеПотока);

		Если ДанныеПотока.Статус = "Пустой" Тогда
			// все задания закончились, завершаем поток
			Прервать;
		Иначе
			ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ДанныеПотока.Результат = ПростыеЧислаВИнтервале(ДанныеПотока.Начало, ДанныеПотока.Конец);
			ДанныеПотока.Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
		КонецЕсли;
		
	КонецЦикла;
	
Конецпроцедуры

Функция ПростыеЧислаВИнтервале(НачалоИнтервала, КонецИнтервала) 

	Результат = Новый Массив;
	Для Ч = НачалоИнтервала По КонецИнтервала Цикл
		ЭтоПростоеЧисло = Истина;
		Для М = 2 По Ч - 1 Цикл
			Если Ч % М = 0 Тогда
				ЭтоПростоеЧисло = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоПростоеЧисло Тогда
			Результат.Добавить(Ч);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции