&НаКлиенте
Процедура ПростыеЧисла(Команда)
	
	ПростыеЧислаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПростыеЧислаНаСервере()
	
	ВремяНачала = ТекущаяДатаСеанса();
	
	ТаблицаЗаданий = РегистрыСведений.Мьютекс.СоздатьЗаполнитьТаблицуЗаданий(
		НачалоИнтервала,
		КонецИнтервала,
		ДлинаПорции
	);
	
	РегистрыСведений.Мьютекс.СоздатьЭкземпляр(0, ТаблицаЗаданий);
	
	МассивПотоков = Новый Массив;
	
	Для НомерПотока = 1 По КоличествоПотоков Цикл
		Поток = ФоновыеЗадания.Выполнить(
			"ДлительныеРасчеты.ПростыеЧисла",
			,
			"поток#" + Строка(НомерПотока), 
			"Поиск простых числел"
		);
		МассивПотоков.Добавить(Поток);
	КонецЦикла;
	
	Пока Истина Цикл
		МассивПотоков = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивПотоков);
		ВсеЗаданияЗавершены = Истина;
		Для Каждого Поток Из МассивПотоков Цикл
			Если Поток.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ВсеЗаданияЗавершены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ВсеЗаданияЗавершены Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	РегистрыСведений.Мьютекс
		.ПолучитьЭкземпляр(0)
		.ОбработатьДанныеЭксклюзивно(
		    "ПрочитатьРезультат",
			ТаблицаЗаданий
		);
	РегистрыСведений.Мьютекс.УдалитьЭкземпляр(0);
	ДлительностьВыполнения = ТекущаяДатаСеанса() - ВремяНачала;
	Задания.Загрузить(ТаблицаЗаданий);
	
	Сообщить("Время выполнения: " + ДлительностьВыполнения + " сек.");

КонецПроцедуры


